app/controllers/cocktails_controller.rb

    def index
      @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"

    def create
      @cocktail = Cocktail.new(validate_params)
      if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Kristin's cocktail"], ["created_at", "2019-12-23 22:38:31.656976"], ["updated_at", "2019-12-23 22:38:31.656976"]]

    def show
      @cocktail = Cocktail.find(params[:id])
      @doses = Dose.all.where(cocktail_id: @cocktail)
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 13]]

    def editing
      # raise
      @cocktail = Cocktail.find(params[:id])
      @doses = Dose.all.where(cocktail_id: @cocktail)
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 13]]