app/controllers/doses_controller.rb

  def new
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose = Dose.new
    @ingredients = Ingredient.all
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients"

  def create
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose = Dose.new(validate_params)
    @dose.cocktail = @cocktail
    if @dose.save
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "cocktail_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "3 cl"], ["cocktail_id", 14], ["ingredient_id", 21], ["created_at", "2019-12-23 22:39:25.695946"], ["updated_at", "2019-12-23 22:39:25.695946"]]