app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "adsadad"], ["email", "asdad@gmasc.com"], ["created_at", "2019-12-24 00:33:02.764964"], ["updated_at", "2019-12-24 00:33:02.764964"]]
---
  def create
    @user = User.new(strong_params)
    @user.save